## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.fatp_azure_web_app_services_hosting.azurerm_storage_account.logs[0] has changed
  ~ resource "azurerm_storage_account" "logs" {
        id                                = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-403/providers/Microsoft.Storage/storageAccounts/findatppr403logs"
        name                              = "findatppr403logs"
        tags                              = {
            "Environment"      = "pr-403"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (37 unchanged attributes hidden)

      ~ network_rules {
          ~ ip_rules                   = [
              - "20.49.37.23",
              + "13.66.79.15",
                # (1 unchanged element hidden)
            ]
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.fatp_azure_web_app_services_hosting.data.azurerm_storage_account_blob_container_sas.logs["app"] will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_storage_account_blob_container_sas" "logs" {
      + connection_string = (sensitive value)
      + container_name    = "find-a-tp-pr-403applogs"
      + expiry            = (known after apply)
      + https_only        = true
      + id                = (known after apply)
      + sas               = (sensitive value)
      + start             = (known after apply)

      + permissions {
          + add    = true
          + create = true
          + delete = true
          + list   = true
          + read   = true
          + write  = true
        }
    }

  # module.fatp_azure_web_app_services_hosting.data.azurerm_storage_account_blob_container_sas.logs["http"] will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_storage_account_blob_container_sas" "logs" {
      + connection_string = (sensitive value)
      + container_name    = "find-a-tp-pr-403httplogs"
      + expiry            = (known after apply)
      + https_only        = true
      + id                = (known after apply)
      + sas               = (sensitive value)
      + start             = (known after apply)

      + permissions {
          + add    = true
          + create = true
          + delete = true
          + list   = true
          + read   = true
          + write  = true
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_key_vault_secret.blobstorageclientsecret will be created
  + resource "azurerm_key_vault_secret" "blobstorageclientsecret" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-403/providers/Microsoft.KeyVault/vaults/find-a-tp-pr-403-kv"
      + name                    = "BlobStorage--ClientSecret"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_key_vault_secret.blobstorageenquiriesdataclientsecret will be created
  + resource "azurerm_key_vault_secret" "blobstorageenquiriesdataclientsecret" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-403/providers/Microsoft.KeyVault/vaults/find-a-tp-pr-403-kv"
      + name                    = "BlobStorageEnquiriesData--ClientSecret"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_key_vault_secret.fatpdbconnectionstring will be created
  + resource "azurerm_key_vault_secret" "fatpdbconnectionstring" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-403/providers/Microsoft.KeyVault/vaults/find-a-tp-pr-403-kv"
      + name                    = "ConnectionStrings--FatpDatabase"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_key_vault_secret.govuknotifyapikey will be created
  + resource "azurerm_key_vault_secret" "govuknotifyapikey" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-403/providers/Microsoft.KeyVault/vaults/find-a-tp-pr-403-kv"
      + name                    = "GovUkNotify--ApiKey"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_linux_function_app.default will be updated in-place
  ~ resource "azurerm_linux_function_app" "default" {
      ~ app_settings                      = {
          + "APPINSIGHTS_INSTRUMENTATIONKEY"          = (sensitive value)
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"   = (sensitive value)
            # (7 unchanged elements hidden)
        }
        id                                = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-403/providers/Microsoft.Web/sites/find-a-tp-pr-403-fa"
        name                              = "find-a-tp-pr-403-fa"
        tags                              = {
            "Environment"      = "pr-403"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (24 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string  = (sensitive value) -> null
          - application_insights_key                = (sensitive value) -> null
            # (25 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_linux_web_app.default[0] will be updated in-place
  ~ resource "azurerm_linux_web_app" "default" {
        id                                = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-403/providers/Microsoft.Web/sites/find-a-tp-pr-403"
        name                              = "find-a-tp-pr-403"
        tags                              = {
            "Environment"      = "pr-403"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (19 unchanged attributes hidden)

      ~ logs {
            # (2 unchanged attributes hidden)

          ~ application_logs {
                # (1 unchanged attribute hidden)

              ~ azure_blob_storage {
                  ~ sas_url           = (sensitive value)
                    # (2 unchanged attributes hidden)
                }
            }

          ~ http_logs {
              ~ azure_blob_storage {
                  ~ sas_url           = (sensitive value)
                    # (1 unchanged attribute hidden)
                }
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_diagnostic_setting.default_key_vault[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "default_key_vault" {
        id                             = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-403/providers/Microsoft.KeyVault/vaults/find-a-tp-pr-403-kv|find-a-tp-pr-403-default-kv-diag"
      + log_analytics_destination_type = "Dedicated"
        name                           = "find-a-tp-pr-403-default-kv-diag"
        # (2 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_diagnostic_setting.default_postgresql_flexible_server[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "default_postgresql_flexible_server" {
        id                             = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-403/providers/Microsoft.DBforPostgreSQL/flexibleServers/find-a-tp-pr-403-psqlflexible-server|find-a-tp-pr-403-postgresql-diag"
      + log_analytics_destination_type = "Dedicated"
        name                           = "find-a-tp-pr-403-postgresql-diag"
        # (2 unchanged attributes hidden)

        # (13 unchanged blocks hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_diagnostic_setting.default_redis_cache[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "default_redis_cache" {
        id                             = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-403/providers/Microsoft.Cache/redis/find-a-tp-pr-403-redis-cache|find-a-tp-pr-403-default-redis-diag"
      + log_analytics_destination_type = "Dedicated"
        name                           = "find-a-tp-pr-403-default-redis-diag"
        # (2 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_diagnostic_setting.function_app[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "function_app" {
        id                             = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-403/providers/Microsoft.Storage/storageAccounts/findatppr403falogs|find-a-tp-pr-403-storage-diag-fa"
      + log_analytics_destination_type = "Dedicated"
        name                           = "find-a-tp-pr-403-storage-diag-fa"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "Capacity" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - metric {
          - category = "Transaction" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = "Transaction"
          + enabled  = true

          + retention_policy {
              + enabled = true
            }
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_diagnostic_setting.web_app[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "web_app" {
        id                             = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-403/providers/Microsoft.Storage/storageAccounts/findatppr403logs|find-a-tp-pr-403-storage-diag"
      + log_analytics_destination_type = "Dedicated"
        name                           = "find-a-tp-pr-403-storage-diag"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "Capacity" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - metric {
          - category = "Transaction" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = "Transaction"
          + enabled  = true

          + retention_policy {
              + enabled = true
            }
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_diagnostic_setting.webhook[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "webhook" {
        id                             = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-403/providers/Microsoft.Logic/workflows/find-a-tp-pr-403-webhook-workflow|find-a-tp-pr-403-webhook-diag"
      + log_analytics_destination_type = "Dedicated"
        name                           = "find-a-tp-pr-403-webhook-diag"
        # (2 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_scheduled_query_rules_alert.email_processing_fa_error_alert[0] will be updated in-place
  ~ resource "azurerm_monitor_scheduled_query_rules_alert" "email_processing_fa_error_alert" {
      ~ enabled                 = false -> true
        id                      = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-403/providers/Microsoft.Insights/scheduledQueryRules/find-a-tp-pr-403-fa-email-processing-errors"
        name                    = "find-a-tp-pr-403-fa-email-processing-errors"
        tags                    = {
            "Environment"      = "pr-403"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_scheduled_query_rules_alert.web_app_service[0] will be updated in-place
  ~ resource "azurerm_monitor_scheduled_query_rules_alert" "web_app_service" {
      ~ enabled                 = false -> true
        id                      = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-403/providers/Microsoft.Insights/scheduledQueryRules/find-a-tp-pr-403-webapp-errors"
        name                    = "find-a-tp-pr-403-webapp-errors"
        tags                    = {
            "Environment"      = "pr-403"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_resource_group.default[0] will be updated in-place
  ~ resource "azurerm_resource_group" "default" {
        id       = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-403"
        name     = "s177d01-ntp-pr-403"
      ~ tags     = {
          ~ "Environment"      = "Dev" -> "pr-403"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (1 unchanged attribute hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_storage_account_network_rules.logs[0] will be updated in-place
  ~ resource "azurerm_storage_account_network_rules" "logs" {
        id                         = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-403/providers/Microsoft.Storage/storageAccounts/findatppr403logs"
      ~ ip_rules                   = [
          - "13.66.79.15",
            # (1 unchanged element hidden)
        ]
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 4 to add, 12 to change, 0 to destroy.
```
</details>